"""
Задание 5.

Выполнить пинг веб-ресурсов yandex.ru, youtube.com и
преобразовать результаты из байтовового в строковый тип на кириллице.

Подсказки:
--- используйте модуль chardet, иначе задание не засчитается!!!
"""

import subprocess
import chardet

addresses = [['ping', 'yandex.ru'], ['ping', 'youtube.com']]
for log in addresses:

    process = subprocess.Popen(log, stdout=subprocess.PIPE)

    for line in process.stdout:
        result = chardet.detect(line)
        print(result)
        line = line.decode(result['encoding']).encode('utf-8')
        print(line.decode('utf-8'))
        print("-" * 100)
